TexhFexLabs/HydroNodeStation/stm32_node/LoRaWAN/App/lora_app.c
/* USER CODE END PB_Callbacks */

static void SendTxData(uint8_t port)
{
  /* USER CODE BEGIN SendTxData_1 */
  sensor_t sensor_data;
  uint8_t bufferSize = 0;

  EnvSensors_Read(&sensor_data);

  /* Read SHT45 — overrides default values from EnvSensors_Read */
  SHT45_Data_t sht45;
  int32_t sht45_ret = SHT45_Read(&sht45);
  if (sht45_ret == SHT45_OK)
  {
    sensor_data.temperature = sht45.temperature;
    sensor_data.humidity    = sht45.humidity;
    /* stm32_tiny_vsnprintf has no %f — split into integer and decimal parts */
    int16_t  t10  = (int16_t)(sht45.temperature * 10.0f);
    uint16_t rh10 = (uint16_t)(sht45.humidity   * 10.0f);
    APP_LOG(TS_ON, VLEVEL_M, "SHT45: T=%d.%d degC  RH=%d.%d%%\r\n",
            t10 / 10, (t10 < 0 ? -t10 : t10) % 10,
            rh10 / 10, rh10 % 10);
  }
  else
  {
    APP_LOG(TS_ON, VLEVEL_M, "SHT45 read error: %d\r\n", (int)sht45_ret);
  }

  /* Read BMP390 — Forced mode, single measurement, auto-returns to sleep */
  BMP390_Data_t bmp390;
  int32_t bmp390_ret = BMP390_Read(&bmp390);
  if (bmp390_ret == BMP390_OK)
  {
    sensor_data.pressure = bmp390.pressure_hPa;
    /* stm32_tiny_vsnprintf has no %f — split into integer and decimal parts */
    int32_t  p_int = (int32_t)bmp390.pressure_hPa;
    uint32_t p_dec = (uint32_t)((bmp390.pressure_hPa - (float)p_int) * 100.0f);
    int16_t  bt10  = (int16_t)(bmp390.temperature * 10.0f);
    APP_LOG(TS_ON, VLEVEL_M, "BMP390: P=%d.%02u hPa  T=%d.%d degC\r\n",
        (int)p_int, (unsigned int)p_dec,
            bt10 / 10, (bt10 < 0 ? -bt10 : bt10) % 10);
  }
  else
  {
    APP_LOG(TS_ON, VLEVEL_M, "BMP390 read error: %d\r\n", (int)bmp390_ret);
  }

  LTR390_Data_t ltr390;
  int32_t ltr390_ret = LTR390_ReadUV(&ltr390);
  if (ltr390_ret == LTR390_OK)
  {
    sensor_data.uv_raw = ltr390.uvs_raw;
    uint16_t uvi100 = (uint16_t)(ltr390.uvi_est * 100.0f);
    APP_LOG(TS_ON, VLEVEL_M, "LTR390: UVS=%u  UVI~%d.%02d\r\n",
            (unsigned int)ltr390.uvs_raw,
            uvi100 / 100,
            uvi100 % 100);
  }
  else
  {
    APP_LOG(TS_ON, VLEVEL_M, "LTR390 read error: %d\r\n", (int)ltr390_ret);
  }

  MAX17048_Data_t max17048;
  int32_t max17048_ret = MAX17048_Read(&max17048);
  if (max17048_ret == MAX17048_OK)
  {
    sensor_data.battery_voltage = max17048.voltage_v;
    APP_LOG(TS_ON, VLEVEL_M, "MAX17048: VBAT=%d.%03d V\r\n",
            (int)max17048.voltage_mv / 1000,
            (int)max17048.voltage_mv % 1000);
  }
  else
  {
    APP_LOG(TS_ON, VLEVEL_M, "MAX17048 read error: %d\r\n", (int)max17048_ret);
  }

  int32_t scd41_start_ret = SCD41_StartCo2SingleShot();
  if (scd41_start_ret == SCD41_STATUS_OK)
  {
    uint16_t scd41_co2_ppm = 0U;
    int32_t scd41_read_ret;

    HAL_Delay(SCD41_SINGLE_SHOT_WAIT_MS);
    scd41_read_ret = SCD41_ReadCo2SingleShot(&scd41_co2_ppm, NULL, NULL);
    if (scd41_read_ret == SCD41_STATUS_OK)
    {
      APP_LOG(TS_ON, VLEVEL_M, "SCD41: CO2=%u ppm\r\n", (unsigned int)scd41_co2_ppm);
    }
    else
    {
      APP_LOG(TS_ON, VLEVEL_M, "SCD41 read error: %d\r\n", (int)scd41_read_ret);
    }
  }
  else
  {
    APP_LOG(TS_ON, VLEVEL_M, "SCD41 start error: %d\r\n", (int)scd41_start_ret);
  }

  APP_LOG(TS_ON, VLEVEL_M, "VDDA: %d\r\n", GetBatteryLevel());
  APP_LOG(TS_ON, VLEVEL_M, "temp: %d\r\n", (int16_t)(sensor_data.temperature));

  enum
  {
    LPP_CH_PRESSURE = 0,
    LPP_CH_TEMPERATURE,
    LPP_CH_HUMIDITY,
    LPP_CH_UV_RAW,
    LPP_CH_BATTERY_V,
  };

  CayenneLppReset();

  /* Fixed CayenneLPP mapping:
   * ch0 pressure (BMP390), ch1 temperature (SHT45), ch2 humidity (SHT45),
    * ch3 UV raw (LTR390, carried as luminosity), ch4 battery voltage (MAX17048). */
  CayenneLppAddBarometricPressure(LPP_CH_PRESSURE, sensor_data.pressure);
  CayenneLppAddTemperature(LPP_CH_TEMPERATURE, sensor_data.temperature);
  CayenneLppAddRelativeHumidity(LPP_CH_HUMIDITY, sensor_data.humidity);

  /* Use LPP luminosity field to carry LTR390 UV raw counts (16-bit configured range). */
  CayenneLppAddLuminosity(LPP_CH_UV_RAW,
                          (sensor_data.uv_raw > 65535U) ? 65535U : (uint16_t)sensor_data.uv_raw);

  /* Battery voltage from MAX17048 on Analog Input (0.01 V resolution in CayenneLPP). */
  CayenneLppAddAnalogInput(LPP_CH_BATTERY_V, sensor_data.battery_voltage);

  CayenneLppCopy(AppDataBuffer);
  bufferSize = CayenneLppGetSize();

  if (JoinLedTimer.IsRunning)
  {
    UTIL_TIMER_Stop(&JoinLedTimer);
    HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET); /* LED_RED */
  }

  ASSERT_SMTC_MODEM_RC(smtc_modem_request_uplink(STACK_ID, port, false, AppDataBuffer, bufferSize));

  if (EventType == TX_ON_TIMER)
  {
    smtc_modem_status_mask_t status_mask = 0;
    smtc_modem_get_status(STACK_ID, &status_mask);
    /* Restart periodical uplink alarm */
    /* It is set value by default APP_TX_DUTYCYCLE. If Certification mode is enabled or during join phase, the time is 10s */
    if (CertMode || ((status_mask & SMTC_MODEM_STATUS_JOINED) != SMTC_MODEM_STATUS_JOINED))
    {
      ASSERT_SMTC_MODEM_RC(smtc_modem_alarm_start_timer(CERT_TX_DUTYCYCLE));
    }
    else
    {
      ASSERT_SMTC_MODEM_RC(smtc_modem_alarm_start_timer(APP_TX_DUTYCYCLE));
    }
  }
  /* USER CODE END SendTxData_1 */
}

/* USER CODE BEGIN PrFD_LedEvents */
static bool IsAllZero(const uint8_t *buffer, uint8_t size)
{
  for (uint8_t i = 0; i < size; i++)
  {
    if (buffer[i] != 0U)
    {
      return false;
    }
  }

  return true;
}

static void OnTxTimerLedEvent(void *context)
{
  HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); /* LED_GREEN */
}

static void OnRxTimerLedEvent(void *context)
{
  //HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET); /* LED_BLUE */
}

static void OnJoinTimerLedEvent(void *context)
{
  HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin); /* LED_RED */
}

/* USER CODE END PrFD_LedEvents */

#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
static void OnSleepTimerEvent(void *context)
{
  /* USER CODE BEGIN OnSleepTimerEvent_1 */

  /* USER CODE END OnSleepTimerEvent_1 */
  APP_LOG(TS_ON, VLEVEL_H, "Sleep timer\r\n");

  /* USER CODE BEGIN OnSleepTimerEvent_Last */

  /* USER CODE END OnSleepTimerEvent_Last */
}
#endif /*(LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0) */

/* --- EOF ------------------------------------------------------------------ */
